---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPNetworkSegmentId Properties
MEPNetworkSegmentId Class See Also Send Feedback
---

The MEPNetworkSegmentId type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | The element id where this analytical segment belongs. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SegmentId | The segment identifier. |

# See Also

MEPNetworkSegmentId Class

Autodesk.Revit.DB.Analysis Namespace